{
    "details": {
        "name": "Ayan Sasmal",
        "mobile": "+61 452 299 076",
        "email": "ayan.m.sasmal@gmail.com",
        "location": "Sydney, NSW",
        "github": "https://github.com/ayansasmal/",
        "linkedIn": "https://www.linkedin.com/in/ayan-sasmal/"
    },
    "aboutMe": [
        "Professional Web Application and API developer with more than 8+ years of experience in Java based Application development, 3+ years of experience in Front-end web development and 4+ years of experience as a Full Stack developer. With a vast and varied project experience in a financial institution, I am highly driven with a sense of responsibility and have been an outstanding performer professionally. I am always eager to learn new technology and ways to work better.",
        "I aim to use my experience and knowledge to perform better and hone my skills and be productive for organization."
    ],
    "achievements": [
        "I have received “Super.Tech” award for having delivered the project with quality and without any production issues.",
        "I have been recognized by client for “Performance and Delivery Excellence” multiple times.",
        "I have been recognized as MVP in team for solving various problems faced during project implementations.",
        "I have completed many Infosys Internal Certifications."
    ],
    "qualification": {
        "degree": "Bachelor of Technology",
        "duration": "2007-2011",
        "description": "I have completed 4 years of Bachelors of Technology in Information Technology (IT) domain from GGSIP University, New Delhi in First Division. I had developed a .NET based Desktop Application as final year project to spy on computers in LAN."
    },
    "experiences": [
        {
            "title": "Senior Engineer Full Stack Developer",
            "company": "Cognizant Technologies",
            "duration": "09/2020 - 07/2021",
            "location": "Sydney, NSW, AU",
            "isSelected": true,
            "description": {
                "plainText": "I have been working as a Senior Full Stack developer, for Westpac Banking Corporation as a client for creating new and enhancing existing applications and APIs.",
                "listedText": [
                    "All the projects that I have delivered were in Agile and have used JIRA to manage the work done by the team.",
                    "The new applications have been developed using Spring Boot, Java 1.8, Node.js, React JS, Back-end unit tested with REST Assured, Postman. The existing application have been developed in JSPs and Spring MVC.",
                    "I have successfully documented and helped teams in implementing very complex application and solutions.",
                    "I have worked seamlessly with a team based in India.",
                    "I have created various documents as part of project deliverables."
                ]
            }
        },
        {
            "title": "Full Stack Developer",
            "company": "Innovate IT Consultancy",
            "duration": "05/2020 - 08/2020",
            "location": "Sydney, NSW, AU",
            "isSelected": false,
            "description": {
                "plainText": "I have worked as a Full Stack developer, for Telstra in Sydney as a client for creating new and enhancing existing applications.",
                "listedText": [
                    "All the projects that I have delivered were in Agile and have used JIRA to manage the work done by the team.",
                    "The new applications have been developed using Spring Boot, Java 1.8, Node.js, React JS, Back-end unit tested with REST Assured, Postman. The existing application have been developed in JSPs and Spring MVC.",
                    "I have successfully documented and helped teams in implementing very complex application and solutions.",
                    "I have worked seamlessly with a team based in India.",
                    "I have created various documents as part of project deliverables."
                ]
            }
        },
        {
            "title": "Technology Analyst",
            "company": "TechForce Services",
            "duration": "11/2019 - 05/2020",
            "location": "Sydney, NSW, AU",
            "isSelected": false,
            "description": {
                "plainText": "I have worked for Westpac Bank as a client for creating new applications and enhancing existing one",
                "listedText": [
                    "During this time period, I have designed solutions along with Senior Technical Architects and Technical Leads to integrate various systems, resolving technical issues faced and have been recognized for problem solving skills.",
                    "I have successfully led teams to deliver projects which were complex and had changes across multiple systems.",
                    "I have created and updated API Definitions using Swagger tool for the newly created APIs.",
                    "The new applications have been developed using Spring Framework, Spring Boot, Node js, React JS, Hibernate Framework using DB2 or SQL Server as the database and Back-end unit tested with REST Assured, Postman.",
                    "The existing application have been developed in AngularJS (1.x) and Spring MVC.",
                    "I have successfully documented and helped teams in realising and implementing very complex application and solutions.",
                    "All the projects that I have delivered were in Agile and have used JIRA to manage the work done by the team.",
                    "I have created various documents as part of project deliverables."
                ]
            }
        },
        {
            "title": "Technology Analyst",
            "company": "Infosys Technology Limited",
            "duration": "01/2015 - 05/2019",
            "location": "Sydney, NSW, AU",
            "isSelected": false,
            "description": {
                "plainText": "I have worked for leading Westpac Bank as a client for creating new and enhancing existing credit card origination applications and updating the portal to add documents for verification.",
                "listedText": [
                    "During this time period, I have led various teams, we have reduced the clicks and steps to be taken by customer to apply for Credit Cards for the bank by more than 50% and approval SLA have been reduced by 50%.",
                    "I have designed solutions along with Senior Technical Architects and Technical Leads to integrate various systems, resolving technical issues faced and have been recognized for problem solving skills.",
                    "I have created and updated API Definitions using Swagger tool for the newly created APIs.",
                    "The new applications have been developed using Spring Framework, Spring Boot, Node js, React JS, Hibernate Framework using DB2 or SQL Server as the database and Back-end unit tested with REST Assured, Postman.",
                    "The existing application have been developed in AngularJS (1.x) and Spring MVC.",
                    "I have successfully implemented JWT based verification mechanism and data channel between applications on different platforms.",
                    "I have created various documents as part of project deliverables."
                ]
            }
        },
        {
            "title": "Senior Systems Engineer",
            "company": "Infosys Technology Limited",
            "duration": "01/2014 - 01/2015",
            "location": "Pune, IN",
            "isSelected": false,
            "description": {
                "plainText": "I have worked for leading Bank in Australia as a client in developing an enterprise web application on a Spring MVC based architecture with extensive use of add-ons like jQuery, CSS, RESTful Web services, Maven and jUnit.",
                "listedText": [
                    "During this time period I have developed a complete functional module for the Web Application and a JUnit based reusable component for Sanity Checks.",
                    "Have learned a lot with Hands On experience in Spring MVC based application development.",
                    "Gained rich experience of applications like Maven, Tomcat and WebSphere."
                ]
            }
        },
        {
            "title": "Systems Engineer",
            "company": "Infosys Technology Limited",
            "duration": "04/2012 - 01/2014",
            "location": "Mysuru, IN",
            "isSelected": false,
            "description": {
                "plainText": "I have worked for Education, Talent & Assessment, formerly known as Education & Research, a Business Enabling Function of Infosys Technology Limited as an internal client.",
                "listedText": [
                    "During this time period have developed from scratch, deployed successfully and maintained an Eclipse IDE Based application to replace a 3rd party application for Hands-On Assessments and Assignments. To support the newly developed application, have developed and deployed in-numerous Java and .NET based application.",
                    "Received “Best Performer” award.",
                    "Have successfully developed and maintained Eclipse-IDE Plugins to create a controlled environment for giving assessments and daily assignments on Oracle Based RDBMS and Core Java.",
                    "Have provided a single platform which allowed almost 20 times more simultaneous users to attempt assessments and practice assignments.",
                    "Have developed a framework and an application to evaluate and assess SQL or PL/SQL written by trainees.",
                    "Have developed application to create question papers and evaluation related artefacts from a pool of questions and solutions.",
                    "Have reduced the operation time for Assessments and Result Generation by up to 80%.",
                    "Have led a team of 10 C# developers for developing a .NET based version of the application for assessments. Agile SCRUM Methodologies were followed as Software Development Framework.",
                    "Have delivered and assisted in more than 160 hours of classroom sessions of Core Java and Oracle Based RDBMS Concepts."
                ]
            }
        }
    ],
    "softSkills": [
        {
            "title": "Versatile"
        },
        {
            "title": "Innovative"
        },
        {
            "title": "Hardworking"
        },
        {
            "title": "Passionate"
        },
        {
            "title": "Problem Solving"
        },
        {
            "title": "Communication Skills"
        }
    ],
    "bestPracticesSkills": [
        {
            "title": "OWASP"
        },
        {
            "title": "Secure Code by Design"
        },
        {
            "title": "SOLID"
        },
        {
            "title": "SLAP"
        },
        {
            "title": "DRY"
        },
        {
            "title": "Continuous Integration (CI)"
        },
        {
            "title": "Continuous Deployment (CD)"
        },
        {
            "title": "Test Driven Development (TDD)"
        },
        {
            "title": "Behaviour Driven Development (BDD)"
        },
        {
            "title": "Agile Methodologies"
        },
        {
            "title": "SCRUM (Kanban)"
        }
    ],
    "skills": [
        {
            "title": "Java 7",
            "isSpeciality": true
        },
        {
            "title": "JavaScript (ES5, ES6 +)",
            "isSpeciality": true
        },
        {
            "title": "RESTFul APIs",
            "isSpeciality": true
        },
        {
            "title": "Node.js",
            "isSpeciality": true
        },
        {
            "title": "React JS",
            "isSpeciality": true
        },
        {
            "title": "Java 8",
            "isSpeciality": false
        },
        {
            "title": "Angular JS (1.x)",
            "isSpeciality": false
        },
        {
            "title": "Angular (2+)",
            "isSpeciality": false
        },
        {
            "title": "HTML5",
            "isSpeciality": false
        },
        {
            "title": "CSS3",
            "isSpeciality": false
        },
        {
            "title": "TypeScript",
            "isSpeciality": false
        },
        {
            "title": "Spring Boot/Framework",
            "isSpeciality": true
        },
        {
            "title": "Hibernate",
            "isSpeciality": false
        },
        {
            "title": "Swagger and OAS",
            "isSpeciality": true
        },
        {
            "title": "jUnit",
            "isSpeciality": false
        },
        {
            "title": "REST Assured",
            "isSpeciality": false
        },
        {
            "title": "Mongoose",
            "isSpeciality": false
        },
        {
            "title": "Maven",
            "isSpeciality": false
        },
        {
            "title": "Git",
            "isSpeciality": false
        },
        {
            "title": "SonarQube",
            "isSpeciality": false
        },
        {
            "title": "Jenkins",
            "isSpeciality": false
        },
        {
            "title": "Docker",
            "isSpeciality": false
        },
        {
            "title": "MongoDB",
            "isSpeciality": false
        },
        {
            "title": "Oracle RDBMS",
            "isSpeciality": false
        },
        {
            "title": "DB2",
            "isSpeciality": false
        }
    ]
}
